namespace TelegramBot.Messages;
public static class PersonalAreaMessages
{
    public static string PersonalAreaHome =
@"Добро пожаловать в твой личный кабинет. Здесь собраны самые нужные ссылки и функции, чтобы твой рабочий процесс был максимально удобным. Если потребуется помощь, я всегда на связи!";

    public static string PersonalAreaLinks =
@"<b>Полезные ссылки для тебя 📎</b>
Я собрал для тебя все важные ресурсы, которые пригодятся в работе. Выбирай нужную ссылку ниже, и всё будет под рукой:";

    public static string PersonalAreaFAQ =
@"<b>Есть вопросы? Я готов помочь! 📝</b>
Здесь собраны самые частые вопросы. Выбери интересующий тебя пункт, и я расскажу обо всём подробнее:

💰 - Как и когда выплачивается зарплата?
💸 - Есть ли пересмотр зарплат? Как часто, от чего зависит?
📈 - От чего зависит повышение в должности?
🎁 - Какие бенефиты есть в компании?
🏠 - Можно ли работать из дома? Какой график работы?
🏢 - Будет ли у меня рабочее место в офисе? Что вообще есть в офисе?
💻 - Что предоставляется из техники сразу, а что — по запросу?
🗣 - Как происходит общение внутри компании?
🌴 - Сколько длится отпуск? Когда в него можно уйти? Как считаются отпускные?
🤒 - Что делать, если я заболел? Сколько мне выплатят после больничного?
🎉 - Есть ли корпоративы?
✈️ - Хочу поехать в командировку";

    public static string FaqSalary =
@"<b>💰 Как и когда выплачивается зарплата?</b>

Заработная плата выплачивается дважды в месяц — 10 и 25 числа.

Расчетный лист будет приходить тебе ежемесячно 10-го числа на рабочу почту. Доступ к файлу защищен паролем, который состоит из серии и номера твоего паспорта без пробелов.

Зарплатные проекты оформлены с банками: Т-Банк, Сбербанк и ВТБ.

Если у тебя остались вопросы, напиши бухгалтеру по заработной плате <a href=""https://teams.microsoft.com/l/chat/0/0?users=olga.maksaeva@travelline.ru"">Ольге Максаевой</a>.";
    public static string FaqSalaryReview =
@"<b>💸 Есть ли пересмотр зарплат? Как часто, от чего зависит?</b>

У нас есть ежегодная индексация и пересмотр зп по результатам аттестации.";

    public static string FaqPromotion =
@"<b>📈 От чего зависит повышение в должности?</b>

Повышение в должности не привязано к какому-то месяцу и может произойти в течение года, если уровень твоих компетенций, задач и результатов соответствуют более высокому уровню должности.";

    public static string FaqBenefitsSelectLocation =
@"<b>🎁 Какие бенефиты есть в компании?</b>

<b>Давай определимся, как ты работаешь:</b>
Я расскажу тебе про условия, которые лучше всего подойдут для твоего формата работы. Выбери, пожалуйста, подходящий вариант ниже, чтобы я мог показать тебе всю нужную информацию.";

    public static string FaqRemote =
@"<b>🏠 Можно ли работать из дома? Какой график работы?</b>

Если ты из Йошкар-Олы, то мы предлагаем офисный формат работы. Наш офис находится по адресу ул. Комсомольская, 112. 

Если ты не из Йошкар-Олы, то тебе доступен полностью удаленный формат работы.

Также у нас есть офисы в Санкт-Петербурге и Казани — при желании их также можно посещать в свободном режиме.

Офис в Санкт-Петербурге находится по адресу: БЦ Stels, ул. Боровая, 32. Контактное лицо — <a href=""https://teams.microsoft.com/l/chat/0/0?users=lena.lezhnyakova@travelline.ru"">HR Елена Лежнякова</a>. 

Офис в Казани располагается по адресу: ул. Право-Булачная, д. 35/2  Контактное лицо — <a href=""https://teams.microsoft.com/l/chat/0/0?users=andrei.kolpakov@travelline.ru"">Андрей Колпаков</a>. 

Основные рабочие часы с 9 до 18 МСК c обеденным перерывом на 1 час, если ты из другого часового пояса, заранее обговори свой график с руководителем и командой!";

    public static string FaqOffice =
@"<b>🏢 Будет ли у меня рабочее место в офисе? Что вообще есть в офисе?</b>

Если ты из Йошкар-Олы, то за тобой будет закрепленное рабочее место. В нашем головном офисе в Йошкар-Оле есть библиотека, переговорки, спортзал, музыкальная студия и кухня со снэками и разнообразными напитками.

Если ты планируешь посещать наш офис в Санкт-Петербурге или Казани, у нас действует формат свободного размещения. Это значит, что у нас нет закреплённых рабочих мест — ты можешь занять любое свободное место, которое тебе понравится. Если ты планируешь ходить на постоянной основе, мы закрепим за тобой одно рабочее место. 

Контактное лицо по офису в СПБ — <a href=""https://teams.microsoft.com/l/chat/0/0?users=lena.lezhnyakova@travelline.ru"">HR Елена Лежнякова</a>.

Контактное лицо по офису в Казани — <a href=""https://teams.microsoft.com/l/chat/0/0?users=andrei.kolpakov@travelline.ru"">Андрей Колпаков</a>.";

    public static string FaqEquipment =
@" <b>💻 Что предоставляется из техники сразу, а что — по запросу?</b>

Если ты офисный сотрудник из Йошкар-Олы, мы оборудуем для тебя полноценное рабочее место и предоставим всю необходимую технику для комфортной работы.
 
Мы обеспечиваем всех удаленных сотрудников виндовыми ноутбуками для работы и отправим их тебе домой, в комплекте также идет гарнитура и мышь. Если тебе понадобится монитор для работы — скажи об этом своему HR.";

    public static string FaqCommunication =
@"<b>🗣 Как происходит общение внутри компании?</b>

Общение в компании неформальное, но уважительное друг к другу. Общаемся по имени и на «ты».

Все письменные коммуникации происходят в принятом корпоративном мессенджере Teams, где есть закрытые чаты команд и открытые каналы в техническом отделе. Устные коммуникации также в Teams. 

Рабочая почта Outlook, есть несколько флудчатов в Telegram с коллегами. Мы уважаем личное пространство друг друга и стараемся не писать в личные соцсети за исключением экстренных случаев. 

Будет здорово, если на созвонах ты будешь включать веб-камеру. Если ее нет, то сделай заявку на приобретение через <a href=""https://jira.travelline.ru/servicedesk/customer/portal/9/create/491"">AdminDesk</a>. Бывает, что ее отсутствие временно, тогда на помощь придет твой телефон.";

    public static string FaqVacation =
@"<b>🌴 Сколько длится отпуск? Когда в него можно уйти? Как считаются отпускные?</b>

Продолжительность отпуска по трудовому кодексу — 28 календарных дней (вместе с выходными).

В первый отпуск желательно уйти не ранее, чем через полгода после оформления, но по договоренности с руководителем можно и раньше. Одна из частей отпуска должна составлять не менее 14 календарных дней согласно ТК РФ.

Мы планируем график отпусков заранее — осенью на будущий год. Но если ты пропустил этот момент, то ничего страшного нет — просто согласуй дату и продолжительность со своим непосредственным руководителем, а потом оформи заявление на отпуск в HR-Link (уточни в команде, кто согласует тебе это заявление). Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-2513/"">здесь</a>";

    public static string FaqSickLeave =
@"<b>🤒 Что делать, если я заболел? Сколько мне выплатят после больничного?</b>

Если ты заболел, сообщи об этом своему руководителю, а при открытии больничного листа - еще и сотрудникам отдела кадров, поставив задачу в Service Desk <a href=""https://jira.travelline.ru/servicedesk/customer/portal/15/create/601"">здесь</a>.
                                                                      
Для корректного начисления заработной платы при закрытия больничного листа поставь задачу в бухгалтерию в Service Desk <a href=""https://jira.travelline.ru/servicedesk/customer/portal/25/create/1075"">здесь</a>.

Всё о больничном — <a href=""https://live.travelline.ru/platform/pages/general/alias-8137/"">здесь</a>.";

    public static string FaqCorporate =
@"<b>🎉 Есть ли корпоративы?</b>

Да! Дважды в год мы устраиваем большие корпоративы всей компании, на которые зовем всех наших сотрудников! Мы оплачиваем дорогу до места проведения, проживание, суточные :)

Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-23181/"">здесь</a>

У техотдела есть и свой традиционный выезд. Обычно он бывает в конце июня.
Если любишь сплавы и походы - не молчи! Говори! Мы их тоже любим и рады, если присоединишься к майскому сплаву. Места всегда разные, состав групп на сплаве - тоже ;)     ";

    public static string FaqBusinessTrip =
@"<b>✈️ Хочу поехать в командировку</b>

Для покупки билеты и бронирования отелей мы используем сервис <a href=""https://trivio.ru/"">Trivio</a>

Здесь наш подробный гайд по командировке: https://confluence.travelline.lan/pages/viewpage.action?pageId=253633743

А здесь собрали крутые места Йошкар-Олы, которые стоит посетить: https://confluence.travelline.lan/pages/viewpage.action?pageId=242286951

Если что-то непонятно или нужна помощь — пиши HR!";

    public static string FaqBenefitsSelect =
@"<b>Давай определимся, как ты работаешь:</b>

Я расскажу тебе про условия, которые лучше всего подойдут для твоего формата работы. Выбери, пожалуйста, подходящий вариант ниже, чтобы я мог показать тебе всю нужную информацию.";

    public static string FaqBenefitsRemote =
@"<b>Для удаленных сотрудников</b>
 
💻 Обустройство рабочего места и техника
— мы отправим тебе мощный ноутбук и гарнитуру для созвонов 
— ежемесячно компенсируем затраты на Интернет
— подарим карту с номиналом 10 000 рублей для обустройства рабочего места удаленных сотрудников после испытательного срока. Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-3159/"">ссылка</a> 

🍝 Питание
— компенсация питания в размере 14 000 рублей в месяц со 2-го месяца работы
Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-3159/"">ссылка</a>

🩺 Здоровье
— компенсация спорта с лимитом 30 000 рублей в год после испытательного срока. Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-3159/"">ссылка</a>
— ДМС от страховой компании ВСК и психологические консультации на платформе Ясно после испытательного срока. Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-3227/"">ссылка</a>

📚  Развитие
— профессиональных курсы и участие в профильных конференциях за счет компании после испытательного срока. По вопросам обучения пиши <a href=""https://teams.microsoft.com/l/chat/0/0?users=marina.surnina@travelline.ru"">Марине Сурниной</a>

💸 Премии
— годовой бонус в размере оклада, а также полугодовой бонус в размере половины оклада. Твои достижения по проектам также будут оценены руководителем в виде дополнительной премии

📎 Кое-что еще
— мерч на праздники
— поддержка компании при важных жизненных событиях. Подробнее: <a href=""https://bitrix24.travelline.ru/knowledge/hr/materialnayapomoshch/"">ссылка</a>";

    public static string FaqBenefitsOffice =
@"<b>Для ребят из Йошкар-Олы</b>

☕️ Офис
Есть парковки для автомобилей и велосипедов. Разработчики работают в отдельных кабинетах на 7-10 человек для удобства и концентрации. Кухня оснащена всем необходимым — кофемашина, снеки и фрукты.

🍝 Питание
— ежедневные обеды на выбор от трех поставщиков еды. Обрати внимание, что они по предзаказу. Не пропусти письмо в main на почте от наших хозяюшек. Они всегда напоминают про заказ обеда на пару дней вперед. 
И не забудь подтвердить выбор блюд здесь: http://food.travelline.lan/
Подробнее о питании: <a href=""https://live.travelline.ru/platform/pages/general/alias-8848/"">ссылка</a> 

🩺 Здоровье
— спортивные абонементы с первого месяца работы. Письмо в main улетает в середине месяца. Не пропусти его, если любишь спорт! Тренировок много, есть из чего выбрать! Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-4153/"">ссылка</a> 
— после испытательного срока  становится доступным ДМС от страховой компании ВСК с лимитом 30 000 рублей в год и психологические консультации на платформе Ясно. Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-58334/"">ссылка</a> 

📚 Развитие
— у нас есть своя билиотека, которая постоянно пополняется новыми книгами. 

Перечень книг общей библиотеки: https://library.travelline.lan/index.php
Перечень книг в техотделе: https://confluence.travelline.lan/pages/viewpage.action?pageId=62360574

Раз в квартал PMы собирают запросы от своих команд на книги, которые сотрудники хотели бы добавить в коллекцию, и формируют сводный заказ. После поступления литературы приобретённые издания можно получить в кабинете 321.

— профессиональные курсы и участие в профильных конференциях за счет компании после испытательного срока. По вопросам обучения пиши <a href=""https://teams.microsoft.com/l/chat/0/0?users=marina.surnina@travelline.ru"">Марине Сурниной</a> 

💸 Премии
— годовой бонус в размере оклада, а также полугодовой бонус в размере половины оклада мы получаем по результатам работы всей компании. Твои достижения по проектам также будут оценены руководителем в виде дополнительной премии.
 
📎 Кое-что еще
— мерч на праздники
— поддержка компании при важных жизненных событиях. Подробнее: <a href=""https://live.travelline.ru/platform/pages/general/alias-6647/"">ссылка</a> ";

    public static string PersonalAreaContacts =
@"<b>Основные контакты 📞</b>

Я собрал для тебя все важные контакты, которые пригодятся в работе.
Выбирай нужный контакт ниже по разным вопросам:";

}
